% =========================================================================
% SCRIPT: run_draw_network
% -------------------------------------------------------------------------
% Απλό script - καλεί την FDIR_Dialog_GUI.m για να τρέξει όλο το λογισμικό 
% είναι δηλαδή η διεπαφή με τον χρήστη. Δεν έχει καμία σχέση με τη main FDIR (target_line,
% raw_input_faults κ.λπ.) - είναι ανεξάρτητο εργαλείο οπτικοποίησης.
% =========================================================================
clc; clear; close all;

FDIR_Dialog_GUI();
